# Read Verilog file
read_verilog mem_man.v

# Run generic synthesis pass
synth -top mem_man

# Map Flip-Flops to the NanGate library 
dfflibmap -liberty NangateOpenCellLibrary_typical.lib

# Map the combinational logic to the physical NanGate cells
abc -liberty NangateOpenCellLibrary_typical.lib

# Clean up unused wires
clean

stat -liberty NangateOpenCellLibrary_typical.lib

# Write out Gate-Level Netlist
write_verilog -noexpr -noattr mem_man_full_lib_syn.v
